# UIView Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView Class
Members See Also
---
A class containing data about view windows in the Revit user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class UIView : IDisposable
```

Visual Basic
---
```text
Public Class UIView _
	Implements IDisposable
```

Visual C++
---
```text
public ref class UIView : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..UIView
# See Also
UIView Members
Autodesk.Revit.UI Namespace